# The Golden Gloves
## Topic - Using historical data to predict MLB Hall of Fame status.
#### Data Source - https://www.seanlahman.com/baseball-archive/statistics/  
#### Group Hypothesis - What stats have the most impact on a player making the MLB hall of fame?  
#### Approach to use for analysis - Aggregate stats for each player in regard to batting, fielding, and pitching. Using this data we can attempt to predict hall of fame status using a classificication machine learning method.

In [1]:
# Importing necessary packages
import pandas as pd

In [2]:
# Pandas setup
pd.set_option('display.max_columns', None)

# Hall of Fame Data
Providing example of how two tables could be combined to create a more readble hall of fame table.

In [3]:
# Importing data
people_df = pd.read_csv("Resources/baseballdatabank-master/core/People.csv")
hall_of_fame_df = pd.read_csv("Resources/baseballdatabank-master/core/HallOfFame.csv")

In [4]:
people_df.head()

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,deathCountry,deathState,deathCity,nameFirst,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,NaN,NaN,NaN,David,Aardsma,David Allan,215.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,2021.0,1.0,22.0,USA,GA,Atlanta,Hank,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,USA,GA,Atlanta,Tommie,Aaron,Tommie Lee,190.0,75.0,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,NaN,NaN,NaN,Don,Aase,Donald William,190.0,75.0,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,NaN,NaN,NaN,Andy,Abad,Fausto Andres,184.0,73.0,L,L,2001-09-10,2006-04-13,abada001,abadan01

In [5]:
hall_of_fame_df.head()

,playerID,yearID,votedBy,ballots,needed,votes,inducted,category,needed_note
0,cobbty01,1936,BBWAA,226.0,170.0,222.0,Y,Player,NaN
1,ruthba01,1936,BBWAA,226.0,170.0,215.0,Y,Player,NaN
2,wagneho01,1936,BBWAA,226.0,170.0,215.0,Y,Player,NaN
3,mathech01,1936,BBWAA,226.0,170.0,205.0,Y,Player,NaN
4,johnswa01,1936,BBWAA,226.0,170.0,189.0,Y,Player,NaN

In [6]:
# Example merge and selecting necessary columns
hof_merged_df = pd.merge(hall_of_fame_df, people_df)
hof_merged_df = hof_merged_df[['playerID','nameLast', 'nameGiven', 'inducted', 'votes']]

In [7]:
hof_merged_df.head()

    playerID   nameLast      nameGiven inducted  votes
0   cobbty01       Cobb  Tyrus Raymond        Y  222.0
1   ruthba01       Ruth  George Herman        Y  215.0
2  wagneho01     Wagner     John Peter        Y  215.0
3  wagneho01     Wagner     John Peter        N    5.0
4  mathech01  Mathewson    Christopher        Y  205.0

# Batting Data
Providing a general exmaple of how batting data could be used.

In [8]:
# Importing data
batting_df = pd.read_csv("Resources/baseballdatabank-master/core/batting.csv")

In [9]:
batting_df.drop(columns=['yearID', 'teamID', 'IBB', 'HBP', 'SH', 'SF', 'stint', 'lgID'], inplace=True)
batting_df.head()

    playerID   G   AB   R   H  2B  3B  HR   RBI   SB   CS  BB   SO  GIDP
0  abercda01   1    4   0   0   0   0   0   0.0  0.0  0.0   0  0.0   0.0
1   addybo01  25  118  30  32   6   0   0  13.0  8.0  1.0   4  0.0   0.0
2  allisar01  29  137  28  40   4   5   0  19.0  3.0  1.0   2  5.0   1.0
3  allisdo01  27  133  28  44  10   2   2  27.0  1.0  1.0   0  2.0   0.0
4  ansonca01  25  120  29  39  11   3   0  16.0  6.0  2.0   2  1.0   0.0

In [10]:
# Grouping by playerID and yearID, then sorting by home runs by season
career_batting_df = batting_df.groupby(['playerID']).sum()

In [11]:
# Sorting dataframe by most home runs
career_batting_df.sort_values('HR', ascending=False)

,G,AB,R,H,2B,3B,HR,RBI,SB,CS,BB,SO,GIDP
playerID,,,,,,,,,,,,,
bondsba01,2986,9847,2227,2935,601,77,762,1996.0,514.0,141.0,2558,1539.0,165.0
aaronha01,3298,12364,2174,3771,624,98,755,2297.0,240.0,73.0,1402,1383.0,328.0
ruthba01,2503,8398,2174,2873,506,136,714,2217.0,123.0,117.0,2062,1330.0,2.0
rodrial01,2784,10566,2021,3115,548,31,696,2086.0,329.0,76.0,1338,2287.0,261.0
pujolal01,2862,10839,1843,3236,669,16,662,2100.0,114.0,41.0,1331,1304.0,399.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
howarch02,44,0,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0
howarda01,25,36,6,8,1,0,0,1.0,0.0,0.0,1,8.0,0.0
howarea01,1,0,0,0,0,0,0,1.0,0.0,0.0,0,0.0,0.0
howarfr02,28,0,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0
zychto01,70,0,0,0,0,0,0,0.0,0.0,0.0,0,0.0,0.0

In [12]:
# Showing batting stats of specified player
career_batting_df.loc['bondsba01']

G       2986.0
AB      9847.0
R       2227.0
H       2935.0
2B       601.0
3B        77.0
HR       762.0
RBI     1996.0
SB       514.0
CS       141.0
BB      2558.0
SO      1539.0
GIDP     165.0
Name: bondsba01, dtype: float64